<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:02 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 31
    [7] => 1
    [8] => 2
    [9] => 3
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:10 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 0
    [6] => 1
    [7] => 2
    [8] => 3
    [9] => 4
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:10 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 0
    [7] => 1
    [8] => 2
    [9] => 3
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:11 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 32
    [7] => 1
    [8] => 2
    [9] => 3
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:11 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 32
    [7] => 1
    [8] => 2
    [9] => 3
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:12 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 1
    [7] => 2
    [8] => 3
    [9] => 4
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:12 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 1
    [7] => 2
    [8] => 3
    [9] => 4
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:12 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 1
    [7] => 2
    [8] => 3
    [9] => 4
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:13 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 1
    [7] => 2
    [8] => 3
    [9] => 4
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:17 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 1
    [7] => 2
    [8] => 3
    [9] => 4
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:18 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 1
    [7] => 2
    [8] => 3
    [9] => 4
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /projects.php at 07-05-2011, 09:18 (+0300) say:</b><br />
 <pre>Array
(
    [0] => 26
    [1] => 27
    [2] => 28
    [3] => 29
    [4] => 30
    [5] => 31
    [6] => 1
    [7] => 2
    [8] => 3
    [9] => 4
)
</pre></p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 14-08-2011, 11:20 (+0300) say:</b><br />
 [a=http://bugs.php]</p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 14-08-2011, 11:23 (+0300) say:</b><br />
 [a=http://projectoru.ua/bugs.php]</p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 14-08-2011, 11:26 (+0300) say:</b><br />
 INSERT INTO lol_TSKZ VALUES ('0', ' #3 ', ' [a=http://projectoru.ua/bugs.php?id=3]#3[/a]', '1', '', '1313310392', '', '1', '0', '0','0',''</p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 14-08-2011, 11:29 (+0300) say:</b><br />
 INSERT INTO lol_TSKZ VALUES ('0', 'Исправление бага #3 ', 'Исправление бага [a=http://projectoru.ua/bugs.php?id=3]#3[/a]', '1', '1', '1313310571', '', '1', '0', '0','0','0')</p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 14-08-2011, 11:30 (+0300) say:</b><br />
 INSERT INTO lol_TSKZ VALUES ('0', 'Исправление бага #3 ', 'Исправление бага [a=http://projectoru.ua/bugs.php?id=3]#3[/a]', '1', '1', '1313310621', '1313320621', '1', '0', '0','0','0')</p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 14-08-2011, 11:51 (+0300) say:</b><br />
 2</p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 14-08-2011, 11:51 (+0300) say:</b><br />
 1</p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 14-08-2011, 11:53 (+0300) say:</b><br />
 1</p>
<p><a name='J'></a><b>//-------------<br />
FILE /cron_me.php at 07-01-2012, 00:13 (+0200) say:</b><br />
 a:0:{}</p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 11-01-2012, 16:43 (+0200) say:</b><br />
 0</p>
<p><a name='J'></a><b>//-------------<br />
FILE /actions.php at 11-01-2012, 16:43 (+0200) say:</b><br />
 0</p>
<p><a name='J'></a><b>//-------------<br />
FILE /cron_me.php at 16-01-2012, 06:00 (+0200) say:</b><br />
 a:3:{i:0;a:3:{i:0;s:8:"taskfail";i:1;s:1:"1";i:2;a:20:{s:3:"tid";s:1:"1";s:5:"tname";s:31:"Написание map-editorа";s:5:"tdesk";s:1989:"Настоящая версия доступна на [a=http://br3t.org.ua/works/castAtWillEditor/]br3t.org.ua/works/castAtWillEditor/[/a]

Выдержки из диалога с Крием
<object id=\'rock05\' class=\'rock\'>
  <attribute name=\'HP\' value=\'10\' />
  <attribute name=\'size\' value=\'5.3\'/>
  <shapes>
    <circle radius=\'1.0\' pos=\'0.0, 0.0\'/>
    <box width=\'1.0\' height=\'0.5\' pos=\'0.0, 1.0\'>
  </shapes>
</object>
[b]All_Creater (12:46:56 4/01/2012) [/b]
Из того, что есть сейчас и обязательно нужно
- коэффицент упругости объекта, два коэффицента торможения(линейного и углового), масса, физические параметры, короче
Обязательно нужна возможность редактировать и задавать форму объекта
напоминаю, каждый объект графически - одна модель, но он может состоять из нескольких shape\'ов. Например, неполый домик - один параллелепипед, полый домик - 5 параллелепипедов(у нас 2д, так что прямоугольников), камень - одна окружность. Что-нибудь типа шестерни будет выглядеть жутко. Ну да ладно.
Для каждого объекта задавать шейпы нецелесообразно, так что нужно сделать некий специальный редактор этих самых шейпов, и сохранять в каком-то шаблоне(потому что у всей сотни камней форма ведь одинаковая, зачем 100 раз задавать одно и то же?)
ну и имя материала/имя модели, разумеется.
На у";s:4:"tpro";s:1:"1";s:6:"tmaker";s:1:"1";s:6:"tbdate";s:10:"1324717200";s:6:"tedate";s:10:"1326664740";s:6:"tstate";s:1:"1";s:7:"tnotice";s:1:"0";s:6:"tready";s:2:"20";s:6:"tgroup";s:1:"3";s:6:"tmtask";s:1:"0";s:3:"pid";s:1:"1";s:5:"pname";s:13:"Cast At WIll ";s:5:"pdesc";s:31:"Описание проекта";s:6:"pbdate";s:10:"1324717080";s:6:"pedate";s:10:"1330639140";s:6:"plider";s:1:"1";s:6:"pstate";s:1:"1";s:5:"plogo";s:5:"0.png";}}i:1;a:3:{i:0;s:8:"taskfail";i:1;s:1:"1";i:2;a:20:{s:3:"tid";s:1:"2";s:5:"tname";s:23:"Заюзать progress";s:5:"tdesk";s:71:"Работать, работать и ещё раз работать...";s:4:"tpro";s:1:"2";s:6:"tmaker";s:1:"1";s:6:"tbdate";s:10:"1325681100";s:6:"tedate";s:10:"1326631560";s:6:"tstate";s:1:"1";s:7:"tnotice";s:1:"0";s:6:"tready";s:1:"0";s:6:"tgroup";s:1:"3";s:6:"tmtask";s:1:"0";s:3:"pid";s:1:"2";s:5:"pname";s:17:"Проектор ";s:5:"pdesc";s:697:"TODO:
- полноценная вложенность заданий
- полноценный таймлайн, учитывая выполнение вложенных заданий
- все хайды в карточке проекта открыты по умолчанию
- перекрасить таймлайны (зеленый - выполнено, оранжевыйжелтый - выполняется, синий - остановлена)
- некое подобие багтрекера
- нотифаи по почте за месяц, 2 недели, неделю, три дня и день до окончания выполнения задания сотрудником";s:6:"pbdate";s:10:"1294145040";s:6:"pedate";s:10:"1338551100";s:6:"plider";s:1:"1";s:6:"pstate";s:1:"1";s:5:"plogo";s:5:"0.png";}}i:2;a:3:{i:0;s:8:"taskfail";i:1;s:1:"1";i:2;a:20:{s:3:"tid";s:1:"3";s:5:"tname";s:60:"Табы в карточках задачи, проекта ";s:5:"tdesk";s:72:"Работать, работать и ещё раз работать... ";s:4:"tpro";s:1:"2";s:6:"tmaker";s:1:"1";s:6:"tbdate";s:10:"1325689440";s:6:"tedate";s:10:"1326639900";s:6:"tstate";s:1:"1";s:7:"tnotice";s:1:"0";s:6:"tready";s:1:"0";s:6:"tgroup";s:1:"3";s:6:"tmtask";s:1:"0";s:3:"pid";s:1:"2";s:5:"pname";s:17:"Проектор ";s:5:"pdesc";s:697:"TODO:
- полноценная вложенность заданий
- полноценный таймлайн, учитывая выполнение вложенных заданий
- все хайды в карточке проекта открыты по умолчанию
- перекрасить таймлайны (зеленый - выполнено, оранжевыйжелтый - выполняется, синий - остановлена)
- некое подобие багтрекера
- нотифаи по почте за месяц, 2 недели, неделю, три дня и день до окончания выполнения задания сотрудником";s:6:"pbdate";s:10:"1294145040";s:6:"pedate";s:10:"1338551100";s:6:"plider";s:1:"1";s:6:"pstate";s:1:"1";s:5:"plogo";s:5:"0.png";}}}</p>
<p><a name='J'></a><b>//-------------<br />
FILE /cron_me.php at 17-01-2012, 07:29 (+0200) say:</b><br />
 a:0:{}</p>
